In [99]:
import pandas as pd
import numpy as np
import sklearn

In [118]:
movies = pd.read_csv('movies.csv')

In [101]:
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [102]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9742 entries, 0 to 9741
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   movieId  9742 non-null   int64
 1   title    9742 non-null   object
 2   genres   9742 non-null   object
dtypes: int64(1), object(2)
memory usage: 228.5+ KB

In [103]:
movies.isnull().sum()

movieId    0
title      0
genres     0
dtype: int64

In [104]:
movies.loc[movies['title'].duplicated()]

,movieId,title,genres
5601,26958,Emma (1996),Romance
6932,64997,War of the Worlds (2005),Action|Sci-Fi
9106,144606,Confessions of a Dangerous Mind (2002),Comedy|Crime|Drama|Romance|Thriller
9135,147002,Eros (2004),Drama|Romance
9468,168358,Saturn 3 (1980),Sci-Fi|Thriller

In [105]:
movies.loc[movies['title']== 'Emma (1996)']

      movieId        title                genres
650       838  Emma (1996)  Comedy|Drama|Romance
5601    26958  Emma (1996)               Romance

In [106]:
movies.loc[movies['title']=='War of the Worlds (2005)']

      movieId                     title                            genres
5931    34048  War of the Worlds (2005)  Action|Adventure|Sci-Fi|Thriller
6932    64997  War of the Worlds (2005)                     Action|Sci-Fi

In [107]:
movies.loc[movies['title']=='Confessions of a Dangerous Mind (2002)']

,movieId,title,genres
4169,6003,Confessions of a Dangerous Mind (2002),Comedy|Crime|Drama|Thriller
9106,144606,Confessions of a Dangerous Mind (2002),Comedy|Crime|Drama|Romance|Thriller

In [119]:
movies.drop_duplicates(subset='title',keep='first',inplace=True)

In [120]:
movies['title'].duplicated().sum()

0

In [110]:
movies.loc[movies['title'].duplicated()]

Empty DataFrame
Columns: [movieId, title, genres]
Index: []

In [111]:
movies.loc[movies['title']=='Confessions of a Dangerous Mind (2002)']

,movieId,title,genres
4169,6003,Confessions of a Dangerous Mind (2002),Comedy|Crime|Drama|Thriller

#### String strip to remove year from Title to make its own column

In [121]:
movies

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
9737,193581,Black Butler: Book of the Atlantic (2017),Action|Animation|Comedy|Fantasy
9738,193583,No Game No Life: Zero (2017),Animation|Comedy|Fantasy
9739,193585,Flint (2017),Drama
9740,193587,Bungo Stray Dogs: Dead Apple (2018),Action|Animation
9741,193609,Andrew Dice Clay: Dice Rules (1991),Comedy

In [122]:
movies['year'] =movies['title'].str.extract('.*\((.*)\).*',expand = False)

In [123]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9737 entries, 0 to 9741
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   movieId  9737 non-null   int64
 1   title    9737 non-null   object
 2   genres   9737 non-null   object
 3   year     9725 non-null   object
dtypes: int64(1), object(3)
memory usage: 380.4+ KB

In [ ]:
movies.head()

,movieId,title,genres,year
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1995
1,2,Jumanji (1995),Adventure|Children|Fantasy,1995
2,3,Grumpier Old Men (1995),Comedy|Romance,1995
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance,1995
4,5,Father of the Bride Part II (1995),Comedy,1995

#### Ratings

In [124]:
ratings = pd.read_csv('ratings.csv')
ratings.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [ ]:
ratings.drop('timestamp', axis=1, inplace=True)

In [125]:
ratings.isna().sum()

userId       0
movieId      0
rating       0
timestamp    0
dtype: int64

In [ ]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100836 entries, 0 to 100835
Data columns (total 3 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   userId   100836 non-null  int64
 1   movieId  100836 non-null  int64
 2   rating   100836 non-null  float64
dtypes: float64(1), int64(2)
memory usage: 2.3 MB

In [ ]:
ratings.duplicated().sum()

0

In [126]:
ratings['userId'].duplicated().sum()

100226

In [ ]:
ratings.loc[ratings['userId'].duplicated()]

        userId  movieId  rating
1            1        3     4.0
2            1        6     4.0
3            1       47     5.0
4            1       50     5.0
5            1       70     3.0
...        ...      ...     ...
100831     610   166534     4.0
100832     610   168248     5.0
100833     610   168250     5.0
100834     610   168252     5.0
100835     610   170875     3.0

[100226 rows x 3 columns]

In [ ]:
tags = pd.read_csv('tags.csv')

In [ ]:
tags.drop('timestamp',axis=1,inplace=True)

In [ ]:
tags.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3683 entries, 0 to 3682
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   userId   3683 non-null   int64
 1   movieId  3683 non-null   int64
 2   tag      3683 non-null   object
dtypes: int64(2), object(1)
memory usage: 86.4+ KB

In [ ]:
tags.isna().sum()

userId     0
movieId    0
tag        0
dtype: int64

In [ ]:
tags['tag'].head(10)

0                funny
1      Highly quotable
2         will ferrell
3         Boxing story
4                  MMA
5            Tom Hardy
6                drugs
7    Leonardo DiCaprio
8      Martin Scorsese
9         way too long
Name: tag, dtype: object

In [ ]:
tags['tag'].value_counts()

In Netflix queue     131
atmospheric           36
thought-provoking     24
superhero             24
funny                 23
                    ...
small towns            1
In Your Eyes           1
Lloyd Dobbler          1
weak plot              1
Heroic Bloodshed       1
Name: tag, Length: 1589, dtype: int64

In [ ]:
tags['tag'].max()

'zombies'

In [ ]:
tags['tag'].min()

'"artsy"'

In [ ]:
tags.isna().sum()

userId     0
movieId    0
tag        0
dtype: int64

In [ ]:
tags['movieId'].duplicated().sum()

2111

#### To build the appropriate recc system, ill need a df that contains ratings,and  movies

In [127]:
df = pd.merge(ratings, movies, on='movieId', how='left')

In [128]:
df

,userId,movieId,rating,timestamp,title,genres,year
0,1,1,4.0,964982703,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1995
1,1,3,4.0,964981247,Grumpier Old Men (1995),Comedy|Romance,1995
2,1,6,4.0,964982224,Heat (1995),Action|Crime|Thriller,1995
3,1,47,5.0,964983815,Seven (a.k.a. Se7en) (1995),Mystery|Thriller,1995
4,1,50,5.0,964982931,"Usual Suspects, The (1995)",Crime|Mystery|Thriller,1995
...,...,...,...,...,...,...,...
100831,610,166534,4.0,1493848402,Split (2017),Drama|Horror|Thriller,2017
100832,610,168248,5.0,1493850091,John Wick: Chapter Two (2017),Action|Crime|Thriller,2017
100833,610,168250,5.0,1494273047,Get Out (2017),Horror,2017
100834,610,168252,5.0,1493846352,Logan (2017),Action|Sci-Fi,2017
100835,610,170875,3.0,1493846415,The Fate of the Furious (2017),Action|Crime|Drama|Thriller,2017

#### Checking for matrix sparcity

In [1]:
610*9724

5931640

In [ ]:
n_ratings  = len(df['rating'])
n_users = len(df['userId'].unique())
n_items = len(df['movieId'].unique())
print('Amount of Ratings:',n_ratings)
print('Amount of Users:', n_users)
print('Amount of Movies:', n_items)

Amount of Ratings: 100836
Amount of Users: 610
Amount of Movies: 9724

In [ ]:
sparsity = 1-(n_ratings/(n_users*n_items))
sparsity ### Extremely sparce ~ dominated by values of zero

0.9830003169443864

In [129]:
df.to_csv('movie_ratings.csv')

In [115]:
df.loc[df['year'] == 'Bab']

Empty DataFrame
Columns: [userId, movieId, rating, title, genres, year]
Index: []